{
  "data": [
    {
      "id": "tt0133093",
      "type": "title",
      "title": "The Matrix",
      "year": null,
      "description": "Thomas A. Anderson is a man living two lives. By day he is an average computer programmer and by night a hacker known as Neo. Neo has always questioned his reality, but the truth is far beyond his imagination. Neo finds himself targeted by the police when he is contacted by Morpheus, a legendary computer hacker branded a terrorist by the government. Morpheus awakens Neo to the real world, a ravaged wasteland where most of humanity have been captured by a race of machines that live off of the humans' body heat and electrochemical energy and who imprison their minds within an artificial reality known as the Matrix. As a rebel against the machines, Neo must return to the Matrix and confront the agents: super-powerful computer programs devoted to snuffing out Neo and the entire human rebellion.                Written byredcommander27",
      "certificate": "",
      "duration": "2h 16min",
      "released": "1999-09-03",
      "cast": [
        {"actor":"Keanu Reeves","character":"Neo"},{"actor":"Laurence Fishburne","character":"Morpheus"},{"actor":"Carrie-Anne Moss","character":"Trinity"},{"actor":"Hugo Weaving","character":"Agent Smith"},{"actor":"Gloria Foster","character":"Oracle"},{"actor":"Joe Pantoliano","character":"Cypher"},{"actor":"Marcus Chong","character":"Tank"},{"actor":"Julian Arahanga","character":"Apoc"},{"actor":"Matt Doran","character":"Mouse"},{"actor":"Belinda McClory","character":"Switch"},{"actor":"Anthony Ray Parker","character":"Dozer"},{"actor":"Paul Goddard","character":"Agent Brown"},{"actor":"Robert Taylor","character":"Agent Jones"},{"actor":"David Aston","character":"Rhineheart"},{"actor":"Marc Aden Gray","character":"Choi"}
      ],
      "genres": [
        "action",
        "sci-fi"
      ],
      "directors": [],
      "writers": [],
      "image": "https://images-na.ssl-images-amazon.com/images/M/MV5BNzQzOTk3OTAtNDQ0Zi00ZTVkLWI0MTEtMDllZjNkYzNjNTc4L2ltYWdlXkEyXkFqcGdeQXVyNjU0OTQ0OTY@._V1_UX182_CR0,0,182,268_AL_.jpg",
      "review": {
        "text": "The Matrix...when I first heard about it, I expected just another sci-fi action thriller.  Good and filled with insane stunts, but not terribly intelligent.Boy, was I wrong.  Oh, the stunts are there in spades, all right, and yes, they are awesome.  And the special effects are absolutely amazing (even if similar ones have been used in other movies as a result- and not explained as well).But the movie has plot as well.  It has characters that I cared about.  From Keanu Reeves' excellent portrayal of Neo, the man trying to come to grips with his own identity, to Lawrence Fishburne's mysterious Morpheus, and even the creepy Agents, everyone does a stellar job of making their characters more than just the usual action &quot;hero that kicks butt&quot; and &quot;cannon fodder&quot; roles.  I cared about each and every one of the heroes, and hated the villains with a passion.  It has a plot, and it has a meaning...and lo and behold, a plot does help the fight scenes!  Just try it, if you haven't seen the movie before.  Watch one of the fight scenes.  Then watch the whole movie.  There's a big difference in the feeling and excitement of the scenes- sure, they're great as standalones, but the whole thing put together is an experience unlike just about everything else that's come to the theaters.  Think about it next time you're watching one of the more brainless action flicks...think how much better it COULD be.All I can say is WATCH THIS MOVIE.  If you haven't, you're missing out on one of the best films of all time.  It isn't just special effects, folks.",
        "rating": 8.7
      }
    },
    {
      "id": "tt2911666",
      "type": "title",
      "title": "John Wick",
      "year": null,
      "description": "John Wick is a mob hit man who, upon falling in love, quits. 5 years later, his wife dies and to make sure he's not alone she arranges for a dog to be brought to him after her death. Later, some men wanting his car break in and beat him up and kill his dog. When he recovers, he sets to get the ones who killed his dog. He learns that the leader is the son of his former employer. And the man wanting to protect his son, tries to take care of Wick but he's still as good as he was.                Written byrcs0411@yahoo.com",
      "certificate": "",
      "duration": "1h 41min",
      "released": "2014-10-31",
      "cast": [
        {"actor":"Keanu Reeves","character":"John Wick"},{"actor":"Michael Nyqvist","character":"Viggo Tarasov"},{"actor":"Alfie Allen","character":"Iosef Tarasov"},{"actor":"Willem Dafoe","character":"Marcus"},{"actor":"Dean Winters","character":"Avi"},{"actor":"Adrianne Palicki","character":"Ms. Perkins"},{"actor":"Omer Barnea","character":"Gregori"},{"actor":"Toby Leonard Moore","character":"Victor"},{"actor":"Daniel Bernhardt","character":"Kirill"},{"actor":"Bridget Moynahan","character":"Helen"},{"actor":"John Leguizamo","character":"Aurelio"},{"actor":"Ian McShane","character":"Winston"},{"actor":"Lance Reddick","character":"Charon"}
      ],
      "genres": [
        "action",
        "crime",
        "thriller"
      ],
      "directors": [],
      "writers": [],
      "image": "https://images-na.ssl-images-amazon.com/images/M/MV5BMTU2NjA1ODgzMF5BMl5BanBnXkFtZTgwMTM2MTI4MjE@._V1_UX182_CR0,0,182,268_AL_.jpg",
      "review": {
        "text": "John Wick is something special. It takes as much time setting up elaborate action sequences as it does the world with which it all takes place in. And what a world it is. It reminds me of Millers Crossing and it is cooler than any other recent attempt at noir. We are shown a criminal underworld where, if you are connected, many powerful people know who you are and show you respect. John Wick was connected but he got out. He is the rare killer who has found peace, and he is grateful for that peace. Some young kids steal that from him and he does what he does best, he wages a one man war against the Russian Mafia. It might sound like the film takes quite a leap but it all makes sense. The motives of John and the people who get in the way of his bullets are all very clear, even if it does come across as rather simple. That&#x27;s the plot at it&#x27;s most basic. Then there&#x27;s the action. The film is directed by Reeve&#x27;s stuntman from The Matrix, so this guy knows action. There are sequences that flow so smoothly it puts other action films and their quick cuts to shame. Keaunu moves so fluidly throughout the film and comes across as such a natural that the only disappointment is that we have not seen him like this before. Along the way are plenty of character actors, fans of The Matrix and The Wire will recognize a few people then there are more obvious ones like Ian McShane and Willem Dafoe. Everyone seems to be having a good time. That is another plus for this movie. It get&#x27;s dark at times but overall it is quite fun, not very chipper, but fun. I cannot recommend this movie enough. I believe it is a must see for action fans and for anyone looking for something a bit different from the usual fare.",
        "rating": "10/10"
      }
    },
    {
      "id": "tt2488496",
      "type": "title",
      "title": "Start Wars: The Force Awakens",
      "year": null,
      "description": "30 years after the defeat of Darth Vader and the Empire, Rey, a scavenger from the planet Jakku, finds a BB-8 droid that knows the whereabouts of the long lost Luke Skywalker. Rey, as well as a rogue stormtrooper and two smugglers, are thrown into the middle of a battle between the Resistance and the daunting legions of the First Order.                Written byNoah White",
      "certificate": "",
      "duration": "2h 16min",
      "released": "2015-12-18",
      "cast": [
        {
          "actor": "Harrison Ford",
          "character": "Han Solo"
        },
        {
          "actor": "Mark Hamill",
          "character": "Luke Skywalker"
        },
        {
          "actor": "Carrie Fisher",
          "character": "Princess Leia"
        },
        {
          "actor": "Adam Driver",
          "character": "Kylo Ren"
        },
        {
          "actor": "Daisy Ridley",
          "character": "Rey"
        },
        {
          "actor": "John Boyega",
          "character": "Finn"
        },
        {
          "actor": "Oscar Isaac",
          "character": "Poe Dameron"
        },
        {
          "actor": "Lupita Nyong'o",
          "character": "Maz Kanata"
        },
        {
          "actor": "Andy Serkis",
          "character": "Supreme Leader Snoke"
        },
        {
          "actor": "Domhnall Gleeson",
          "character": "General Hux"
        },
        {
          "actor": "Anthony Daniels",
          "character": "C-3PO"
        },
        {
          "actor": "Max von Sydow",
          "character": "Lor San Tekka"
        },
        {
          "actor": "Peter Mayhew",
          "character": "Chewbacca"
        },
        {
          "actor": "Gwendoline Christie",
          "character": "Captain Phasma"
        },
        {
          "actor": "Joonas Suotamo",
          "character": "Chewbacca Double"
        }
      ],
      "genres": [
        "action",
        "adventure",
        "fantasy",
        "sci-fi"
      ],
      "directors": [],
      "writers": [],
      "image": "https://images-na.ssl-images-amazon.com/images/M/MV5BOTAzODEzNDAzMl5BMl5BanBnXkFtZTgwMDU1MTgzNzE@._V1_UX182_CR0,0,182,268_AL_.jpg",
      "review": {
        "text": "Spoilers follow: I&#x27;ve watched Star Wars 4-6 and I&#x27;ve enjoyed it tremendously.This movie simply has too many plot holes.For example: Why would the First Order rehash a bigger Death Star with exactly the same flaw as the original two. Is the First order incapable of learning from mistakes, or inventing anything new? Its laughably bad. Was it the directors intention to make the First Order look stupid and incompetent? They succeeded.How is it Rey can pilot the Milennium Falcon with no training. Are the laws of common sense not applicable in this movie? I thought Star Wars tried to make everything believable and down-to-earth. Here...not so.Why is Han Solo wearing the same thing as 30 years back. Doesn&#x27;t the writer have any imagination that he could possibly be wearing something different--or be doing something different. This is zero imagination to the extreme.Why would the First Order desperately try to find Luke. Is the First Order so incompetent that the capability to destroy planet is not enough advantage against the resistance. Again it shows the First Order incredibly dumb. Transformers had better villains than this.Where is the dialogue which drives the story. Nobody seemed to say anything remotely interesting or meaningful? How was this script approved&#x3E; To summarize, no matter how much money this makes, its clearly a product of hype--not a good story, nor good direction. This feels like a poor imitation of a great product. Incredible waste.",
        "rating": "1/10"
      }
    },
    {
      "id": "tt4972582",
      "type": "title",
      "title": "Split",
      "year": null,
      "description": "When three girls are kidnapped by a man with 24 different personalities they have to work out which of those personalities will help them escape and which of those personalities will try to stop them. James McAvoy produces a master class performance playing the psychotic kidnapper with 24 personalities.                Written byjjmcmanusnbalshiite",
      "certificate": "",
      "duration": "1h 57min",
      "released": "2017-01-20",
      "cast": [
        {
          "actor": "James McAvoy",
          "character": "Dennis"
        },
        {
          "actor": "Anya Taylor-Joy",
          "character": "Casey Cooke"
        }
      ],
      "genres": [
        "horror",
        "thriller"
      ],
      "directors": [],
      "writers": [],
      "image": "https://images-na.ssl-images-amazon.com/images/M/MV5BZTJiNGM2NjItNDRiYy00ZjY0LTgwNTItZDBmZGRlODQ4YThkL2ltYWdlXkEyXkFqcGdeQXVyMjY5ODI4NDk@._V1_UX182_CR0,0,182,268_AL_.jpg",
      "review": {
        "text": "The double whammy of The Sixth Sense and Unbreakable saw filmmaker M. Night Shyamalan ascend to the throne as the master of twists. Yet after delivering a string of debacles (The Happening, The Last Airbender, and After Earth) his title was lost, seemingly forever. Thanks to a career shakeup&#x97;involving collaboration with super successful low-budget producer Jason Blumhouse (Paranormal Activity, The Purge)&#x97;Shyamalan has announced his return to form with this creepy psychological thriller. Creating an atmosphere of dread via constant tension building and a genuinely unpredictable narrative, Shyamalan is back to his old tricks of misdirection, rug-pulling and Kafka-esque storytelling. Opening with the kidnapping of three teenage girls in an utterly unnerving sequence, the tale unravels to explore the complicated lives of both abductee Casey (Anna Taylor Joy) and split-personality abductor Kevin (James McAvoy). Or is it Barry? Or Patricia? Chewing the scenery with aplomb, McAvoy delights in a role that allows him to segue between an obsessive compulsive weirdo, a frightfully stern mother-figure, a whimsical (and hilarious) 9 year old, and, in the final act, something else entirely. There are undoubtedly flaws&#x97;an underwhelming and frustratingly ambiguous climax for example&#x97;in addition to a few nonsensical genre tropes, but the film&#x27;s tempo and energy diminishes the negative effects of these missteps. Possibly a transcendent movie short of regaining his old position amongst Hollywood royalty, Split is nevertheless an exciting and gratifying thriller that continues the Shyamalanaissance.",
        "rating": "7/10"
      }
    },
    {
      "id": "tt0217869",
      "type": "title",
      "title": "Unbreakable",
      "year": null,
      "description": "This suspense thriller unfolds as the audience is introduced to David Dunn. Not only is he the sole survivor of a horrific train-crash that killed 131 people he doesn't have a scratch on him. Elijah Price is an obscure character who approaches Dunn with a seemingly far fetched theory behind it all.                Written byFilmtwob &lt;webmaster@filmfreak.co.za&gt;",
      "certificate": "",
      "duration": "1h 46min",
      "released": "2001-01-05",
      "cast": [
        {
          "actor": "Bruce Willis",
          "character": "David Dunn"
        },
        {
          "actor": "Samuel L. Jackson",
          "character": "Elijah Price"
        },
        {
          "actor": "Robin Wright",
          "character": "Audrey Dunn"
        }
      ],
      "genres": [
        "drama",
        "mystery",
        "sci-fi",
        "thriller"
      ],
      "directors": [],
      "writers": [],
      "image": "https://images-na.ssl-images-amazon.com/images/M/MV5BMDIwMjAxNzktNmEzYS00ZDY5LWEyZjktM2Y0MmUzZDkyYmZkXkEyXkFqcGdeQXVyNTA4NzY1MzY@._V1_UX182_CR0,0,182,268_AL_.jpg",
      "review": {
        "text": "My kudos to M. Night Shyamalan for proving the consistency of his moviemaking abilities. &quot;Unbreakable&quot; is a movie that is rich in both technical brilliance as well as script quality.First, let me get my one objection for the movie off my chest. The ending could have been done better. The majority of the length of &quot;Unbreakable&quot; does an excellent job of building suspense, with the wonderfully muted, melancholy acting adding depth and tension to the plot. My problem is that it fails to live up to its own expectations; the ending does not consummate entirely what I expected it to. Somehow, in a movie that took painstaking details to illustrate every step and glance, concluding it in the manner that it did felt almost blasphemous. Maybe in a nameless action thriller it could be passed off as mere hackery. But here, it seems strangely out of place, kind of an enigma in itself...Now that the ugly part is over with, I feel almost obligated to sing the praises of &quot;Unbreakable&quot;. Shyamalan's prowess with photographic techniques and processes shows through in this, with rich reds and blacks given to scenes of moist emotion and colder colors dedicated to the bleak, uncaring (uncared for?) world. One technique I particularly liked was the manipulation of photographic mediums, some parts using crisp 35mm films and others using angry, shuttered magnetic (or 16mm?) film. In the end, it all worked very well, because each technique seemed to integrate seamlessly with the plot and mood (notice the confusion and panic at the very end?) &quot;Traffic&quot; is a good example of processing overdose. &quot;Unbreakable&quot;, on the other hand, hones it perfectly. The lushness of this movie comes in close second to the wonderful eye candy of &quot;American Beauty&quot;. I could watch it again easily... with the sound turned off!On the more human side of the spectrum, the acting was wonderful. How nice it is to see Bruce Willis proving himself to be a true A-class actor! His unassuming and insecure behavior worked *perfectly* for this role. Samuel L. Jackson, like always, did a bang-up job with what the script gave him. Robin Wright and Spencer Clark's characters seemed a bit two dimensional, but they seemed to be minor roles compared to the prominence of Willis and Jackson's characters. A little character development would have been appreciated, but if the ending was a result of the time-constraint guillotine, then I would expect the developmental scenes to have gone too.The thing that people seem to complain most about this movie is the plot. I like the premise. A little fantasy in our movies isn't such a bad thing once in a while, is it?",
        "rating": "8/10"
      }
    }
  ]
}